const animals: string[] = [
    "사자", "호랑이", "기린", "코끼리", "얼룩말", "판다", "고릴라", "침팬지", "늑대", "여우",
    "캥거루", "코알라", "북극곰", "남극펭귄", "하마", "코뿔소", "양", "염소", "소", "말",
    "돼지", "사슴", "토끼", "다람쥐", "고슴도치", "비버", "바다표범", "바다사자", "돌고래", "고래",
    "상어", "가오리", "복어", "연어", "금붕어", "잉어", "쿠거", "재규어", "치타", "스라소니",
    "악어", "거북", "이구아나", "코모도용", "개구리", "도롱뇽", "살모사", "킹코브라", "앵무새", "참새",
    "비둘기", "까치", "독수리", "매", "부엉이", "펭귄", "두루미", "학", "오리", "거위",
    "타조", "에뮤", "카멜레온", "다랑어", "문어", "오징어", "새우", "게", "랍스터", "전갈",
    "거미", "바퀴벌레", "개미", "벌", "나비", "잠자리", "메뚜기", "사마귀", "파리", "모기",
    "늑대거미", "꿀벌", "왕나비", "누에", "실잠자리", "화살고기", "청어", "멸치", "물개", "바다거북",
    "플라밍고", "알바트로스", "허밍버드", "카나리아", "박쥐", "스컹크", "너구리", "멧돼지", "가재", "달팽이"
];
const colors: string[] = [
    '빨간', '주황', '노란', '초록', '파란', '남색', '보라', '분홍', '갈색', '회색',
    '진한빨강', '밝은주황', '연한노랑', '진한초록', '진한파랑', '진한남색', '진한보라', '연한분홍', '짙은갈색', '짙은회색',
    '연두색', '녹색', '청록색', '하늘색', '남색', '보라색', '자주색', '분홍색', '갈색', '회색',
    '주황빛', '황토색', '금색', '납색', '은색', '동색', '갈색', '검은색', '흰색', '회색',
    '진홍색', '감청색', '금붕어색', '올리브색', '바이올렛색', '아이보리색', '회색', '하늘색', '흰색', '갈색',
    '빨간색', '노란색', '초록색', '파란색', '보라색', '주황색', '분홍색', '갈색', '회색', '검은색',
    '라이트그린색', '연두색', '민트색', '청록색', '연파란색', '스카이블루색', '라벤더색', '분홍색', '초콜릿색', '진회색',
    '인디고색', '청록색', '바다색', '청옥색', '스틸블루색', '버건디색', '밝은분홍색', '갈색', '회색', '검은색',
    '밝은빨강색', '라임색', '연두색', '남색', '하늘색', '보라색', '연분홍색', '갈색', '회색', '검은색',
    '진한분홍색', '노란색', '연두색', '파란색', '남색', '보라색', '분홍색', '갈색', '회색', '검은색'
];
const fruits: string[] = [
    "사과", "바나나", "체리", "포도", "오렌지", "레몬", "라임", "자몽", "망고", "파인애플",
    "복숭아", "키위", "멜론", "수박", "딸기", "블루베리", "라즈베리", "블랙베리", "크랜베리", "아보카도",
    "파파야", "구아바", "자두", "석류", "코코넛", "무화과", "넥타린", "감", "금귤", "토마토",
    "앵두", "산딸기", "양딸기", "고구마", "감자", "매실", "살구", "아세로라", "배", "멜론",
    "카카오", "드래곤프루트", "패션프룻", "잭프루트", "두리안", "람부탄", "롱간", "리치", "사포딜라", "타마린드",
    "카람볼라", "페르시몬", "피타야", "프룬", "마르멜로", "주니퍼베리", "키위베리", "매화", "선인장열매", "참외",
    "데이트", "허니듀", "자바 애플", "카멜론", "퀸스", "모모르디카", "올리브", "오미자", "유자",
    "비타민나무열매", "스타프루트", "스위트리몬", "타로", "유니온", "벨벳애플", "와일드망고", "야콘", "잔다루카", "자몽",
    "카누티아", "케이프구스베리", "케냐열매", "코코넛", "콜라넛", "크랜베리", "키위", "타마린드", "파파야", "패션프룻"
];
const adjectives: string[] = [
    "멋진", "좋은", "귀여운", "즐거운", "활발한", "밝은", "달콤한", "신선한", "강한", "따뜻한",
    "행복한", "맑은", "빠른", "쾌적한", "안전한", "고운", "편한", "넓은", "높은", "깊은",
    "선명한", "매력적인", "유익한", "아늑한", "정확한", "풍부한", "튼튼한", "정직한", "영리한", "용감한",
    "화려한", "착한", "늠름한", "유명한", "감미로운", "열정적인", "깨끗한", "소중한", "평화로운", "청량한",
    "능숙한", "고급진", "근사한", "신비한", "당당한", "공손한", "세련된", "총명한", "야무진", "재치있는",
    "실용적인", "날렵한", "민첩한", "깔끔한", "새로운", "빛나는", "장엄한", "고상한", "부지런한", "정교한",
    "화사한", "우아한", "이상적인", "순수한", "친절한", "적절한", "특별한", "매혹적인", "창의적인", "간결한",
    "확실한", "우수한", "감동적인", "흥미로운", "강력한", "차분한", "안정된", "신속한", "성실한", "예민한",
    "멋스러운", "기분좋은", "아름다운", "감성적인", "만족한", "능력있는", "진취적인", "품격있는", "자유로운", "정열적인",
    "기쁜", "즉각적인", "깜찍한", "꼼꼼한", "세심한", "온화한", "환한", "재밌는", "신나는", "미묘한"
];

export default function RandomName(): string {
    const colorOrAdjective: string[] = Math.random() < 0.5 ? colors : adjectives;
    const randomColorOrAdjective: string = colorOrAdjective[Math.floor(Math.random() * colorOrAdjective.length)];

    const animalOrFruit: string[] = Math.random() < 0.5 ? animals : fruits;
    const randomAnimalOrFruit: string = animalOrFruit[Math.floor(Math.random() * animalOrFruit.length)];

    return `${randomColorOrAdjective} ${randomAnimalOrFruit} `;
}